/* Suffix on helper tooltip for structured data which tells the user this data applies to Groups */
" (group)" = "（编组）";

/* Suffix on helper tooltip for structured data which tells the user this data applies to Image Layers or Shapes (with image fill) */
" (image)" = "（图像）";

/* Suffix on helper tooltip for structured data which tells the user this data applies to Text Layers */
" (text)" = "（文本）";

/* suffix for when layer is turned into a mask, used in the layer list */
" Mask" = " 蒙版";

/* message when a user tries to open a document which was previously edited in a newer version */
"“%@” was last edited in a newer version of Sketch." = "“%@” 是在更新的 Sketch 版本中编辑的。";

/* new style name, %@ contains the name of the first selected layer */
"%@ Style" = "%@ 个样式";

/* image counter size format */
"%u × %u" = "%1$u × %2$u";

/* image counter title */
"%u Fills" = "%u 项填充";

/* image counter title */
"%u Layers" = "%u 个图层";

/* image counter title */
"%u Layers and Fills" = "%u 图层与填充";

/* Bullet for the list we show in the helper tooltip for linked data menu items */
"• " = "• ";

/* image counter title */
"1 Fill" = "1项填充";

/* image counter title */
"1 Layer" = "1个图层";

/* Message that appears when the client has a coedit document with local changes and there's a newer version on the server */
"A new version of this document is available in Cloud. Your local version may contain unsynced changes which will be lost if you open the Cloud version.\n\nWould you like to discard these local changes or open them as a new document?" = "Cloud 中有该文档的新版本可用。您的本地版本中有未同步的更新，一旦打开 Cloud 版本，这些更新将会丢失。\n\n您是否要丢地本地的变更，还是另作为新文档打开？";

/* Short text style preview string
   The text on a layer list icon that's generated in the code. It's showing the text style. */
"Aa" = "文";

/* Value adaptor produced nil values error description */
"An unexpected error occurred." = "发生未知错误。";

/* Helper tooltip for linked data menu items to explain what you should name the layers in your source to make it work */
"Apply Data to Groups or Symbols.\nContained layers should be named:" = "将素材数据应用于编组或控件。\n所包含的图层应命名为：";

/* color counter title */
"Artboard" = "画板";

/* color counter title */
"Artboards" = "画板";

/* color counter title */
"Border" = "边框";

/* color counter title */
"Borders" = "边框";

/* No comment provided by engineer. */
"Calculating how much space can be saved by scaling down images in the document. Please wait…" = "正在计算通过缩小图像可节省的空间大小。请稍等…";

/* No comment provided by engineer. */
"Calculating reductions…" = "正在计算减少的空间大小…";

/* \"Cancel\" button on corrupted document dialog
   Cancel button on message for Coedit migration warning
   Cancel opening the document, when trying to open a document which was previously edited in a newer version */
"Cancel" = "取消";

/* Reason string for a failed download */
"Check that the provided URL is correct and that it points to a valid assistant" = "检查所提供的网址是否正确以及其是否指向有效的助手";

/* No comment provided by engineer. */
"Close Path" = "闭合路径";

/* No comment provided by engineer. */
"Close Paths" = "闭合路径";

/* menu local-colors name
   Title of the page for colors variables in the user's personal library */
"Color Variables" = "颜色变量";

/* Title of the artboard containing user's color variables */
"Colors generated on %@" = "在 %@ 上生成颜色";

/* No comment provided by engineer. */
"Combined Shape" = "形状结合";

/* \"Contact Support\" button on corrupted document dialog */
"Contact Support" = "联系支持";

/* Error description when unable to update a library. */
"Could not move Sketch library into libraries folder." = "无法将 Sketch 组件库移动到组件库专属文件夹中。";

/* Error description when unable to start the installer for a third-party library. */
"Could not start the installer to download the third-party library." = "无法启动安装程序以下载第三方组件库。";

/* menu item title for creating a new color */
"Create new Color" = "创建新的颜色";

/* menu item title for unlinking and updating a single color */
"Create New Color Variable and Replace" = "创新新的颜色变量并替换";

/* menu item title for creating a new layer style */
"Create New Layer Style" = "创建图层样式";

/* menu item title for unlinking and updating a single layer style */
"Create New Style and Replace" = "创建新的样式并替换";

/* menu item title for unlinking and updating multiple layer styles */
"Create New Styles and Replace" = "创建新的样式并替换";

/* menu item title for creating a new text style */
"Create New Text Style" = "创建字符样式";

/* second phase subtitle for progress sheet used when importing (large) SVG documents, the first %ld is the shape that's being imported, the second %ld is the total shapes being imported */
"Creating shapes %ld of %ld…" = "正在创建形状，已导入%ld，共%ld…";

/* The reset default style menu item in the style overrides */
"Default Style" = "默认样式";

/* No comment provided by engineer. */
"Delete Page" = "删除页面";

/* No comment provided by engineer. */
"Delete Pages" = "删除页面";

/* menu item title for detaching from a color
   menu item title for detaching from shared color */
"Detach from Color Variable" = "与颜色变量解绑";

/* menu item title for detaching from a layer style */
"Detach from Layer Style" = "与图层样式解绑";

/* menu item title for detaching from layer styles */
"Detach from Layer Styles" = "与图层样式解绑";

/* menu item title for detaching from a symbol */
"Detach from Symbol" = "与控件解绑";

/* menu item title for detaching from a text style */
"Detach from Text Style" = "与字符样式解绑";

/* menu item title for detaching from text styles */
"Detach from Text Styles" = "与字符样式解绑";

/* menu item title for detaching styles */
"Detach Styles" = "解绑样式";

/* Layer list boolean ops menu - Difference */
"Difference" = "差集";

/* Discard button on message that appears when the client has a coedit document with local changes and there's a newer version on the server */
"Discard" = "丢弃";

/* Title for the disconnect from data source menu item */
"Disconnect from Data Source" = "与素材源断开连接";

/* menu insert local symbols
   menu insert local textStyles */
"Document" = "文档";

/* Message for Coedit migration warning */
"Document update required." = "需要更新文档。";

/* One of the options to choose from when the user tries to open a document with missing or corrupt metadata */
"Don’t Open" = "请勿打开";

/* Download button on the error message when trying to open very old documents */
"Download Sketch 53" = "下载 Sketch 53";

/* No comment provided by engineer. */
"Dragged Layer" = "已拖动图层";

/* For use in the Edit-Undo menu, English text will appear as 'Undo Duplicate' or 'Redo Duplicate' */
"Duplicate" = "复制";

/* No comment provided by engineer. */
"Duplicate Page" = "复制页面";

/* No comment provided by engineer. */
"Duplicate Pages" = "复制页面";

/* Error shown when downloading and installing an assistant from a web address. */
"Failed to install assistant" = "安装助手失败";

/* No comment provided by engineer. */
"File size will be reduced by about %@." = "文件大小将被减少约 %@。";

/* No comment provided by engineer. */
"File size will be reduced by changing image resolutions." = "降低图像分辨率可减少文件大小。";

/* color counter title */
"Fill" = "填充";

/* color counter title */
"Fills" = "填充";

/* The flow destination override on the symbol source's override configs */
"Hotspot" = "热区";

/* The image override on the symbol source's override configs */
"Image" = "图像";

/* Title for data suppliers section that provide Image Data section in the Data menus */
"Image Data" = "图像素材";

/* No comment provided by engineer. */
"Image size can’t be reduced." = "图像无法再减小。";

/* No comment provided by engineer. */
"Images are already at optimal size." = "图像已达到适合大小。";

/* second phase subtitle for progress sheet used when importing (large) PDF documents, the first %ld is the page that's being imported, the second %ld is the total pages being imported */
"Importing page %ld of %ld" = "正在导入， 第%1$ld页，共%2$ld页";

/* color counter title */
"Inner Shadow" = "内阴影";

/* color counter title */
"Inner Shadows" = "内阴影";

/* Checkbox title that determines whether Data is inserted at Random or Sequentially */
"Insert Data at Random" = "插入随机素材数据";

/* Layer list boolean ops menu - Intersect */
"Intersect" = "交集";

/* The layer style override on the symbol source's override configs */
"Layer Style" = "图层样式";

/* Title for data suppliers section that provide linked/structured (JSON) data in the Data menus */
"Linked Data" = "已关联的素材";

/* Header of the message that appears when the client has a coedit document with local changes and there's a newer version on the server */
"Local document version may contain unsynced changes." = "本地文档版本中可能包含了未同步的变更。";

/* name for clipping mask */
"Mask" = "蒙版";

/* Name for the library that contains the global color presets migrated to swatches */
"Migrated Global Colors" = "迁移通用颜色";

/* For use in the Edit-Undo menu, English text will appear as 'Undo Move' or 'Redo Move' */
"Move" = "移动";

/* No comment provided by engineer. */
"Multiple Color Variables" = "多种颜色变量";

/* No comment provided by engineer. */
"Multiple Layer Styles" = "多种图层样式";

/* No comment provided by engineer. */
"Multiple Styles" = "多种样式";

/* No comment provided by engineer. */
"Multiple Symbols" = "多种控件";

/* No comment provided by engineer. */
"Multiple Text Styles" = "多种字符样式";

/* No comment provided by engineer. */
"No Color Variables" = "没有颜色变量";

/* No comment provided by engineer. */
"No Layer Style" = "无图层样式";

/* No comment provided by engineer. */
"No Text Style" = "无字符样式";

/* Layer list boolean ops menu - None */
"None" = "无";

/* OK button on the error message when trying to open very old documents */
"OK" = "好的";

/* \"Open Anyway\" button on corrupted document dialog
   Open the document anyway, when trying to open a document which was previously edited in a newer version */
"Open Anyway" = "仍然打开";

/* Save button on message that appears when the client has a coedit document with local changes and there's a newer version on the server */
"Open as New" = "另行打开";

/* No comment provided by engineer. */
"Open Color Variable in Library…" = "在组件库中打开颜色变量…";

/* No comment provided by engineer. */
"Open Layer Style in Library…" = "在组件库中打开图层样式…";

/* No comment provided by engineer. */
"Open Path" = "打开路径";

/* No comment provided by engineer. */
"Open Paths" = "打开路径";

/* No comment provided by engineer. */
"Open Symbol in Library…" = "在组件库中打开控件…";

/* No comment provided by engineer. */
"Open Text Style in Library…" = "在组件库中打开字符样式…";

/* message when a user tries to open a document which was previously edited in a newer version */
"Opening it in this version of Sketch (%@) may result in some data being lost." = "在 Sketch (%@) 打开可能会导致部分素材丢失。";

/* alert displayed when not all of the document could be read asking the user if they want to proceed */
"Opening it may result in some or all content being lost. We recommend making a backup copy of your document before continuing.\n\nIf possible, please consider sending your backup document to our Customer Support to help us improve this feature." = "打开后可能会导致部分或全部内容丢失。建议您先做一个文档备份。\n\n若您愿意考虑，请发送一份备份文件到我们的客服，以便我们进一步优化。";

/* Value adaptor produced nil values error recovery suggestion */
"Please provide a valid value." = "请输入有效值。";

/* No comment provided by engineer. */
"Please provide a valid value. The maximum allowed value is %1$g." = "请输入有效值。允许的最大值为%1$g。";

/* No comment provided by engineer. */
"Please provide a valid value. The minimum allowed value is %1$g." = "请输入有效值。允许的最小值为%1$g。";

/* first phase subtitle for progress sheet used when importing (large) PDF documents */
"Please wait while the %@ is imported" = "正在导入%@，请稍等";

/* first phase subtitle for progress sheet used when importing (large) SVG documents */
"Please wait while the SVG is imported" = "正在导入 SVG，请稍等";

/* No comment provided by engineer. */
"Reduce" = "减少";

/* 'Refresh Data' menu in the various Data menus */
"Refresh Data" = "刷新素材";

/* 'Refresh Data from Symbol Source' shown in the Data menu when a symbol instance is selected */
"Refresh Data from Symbol Source" = "刷新控件资源";

/* menu item title for resetting a shared color */
"Reset Color" = "重设颜色";

/* menu item title for resetting a shared color */
"Reset Color Variable" = "重设颜色变量";

/* menu item title for resetting a layer style
   menu item title for resetting a text style */
"Reset Style" = "重设样式";

/* menu item title for resetting multiple layer styles
   menu item title for resetting multiple text styles
   menu item title for resetting styles */
"Reset Styles" = "重设样式";

/* color counter title */
"Shadow" = "阴影";

/* color counter title */
"Shadows" = "阴影";

/* The name of the data supplier group for all builtin Sketch data suppliers */
"Sketch Data" = "Sketch 素材";

/* Message displayed when not all of the document could be read asking the user if they want to proceed */
"Some problems were found in “%@”." = "在 “%@” 中发现了一些问题。";

/* menu local-styles name */
"Styles" = "样式";

/* Layer list boolean ops menu - Subtract */
"Subtract" = "减去顶层";

/* The symbol ID on the symbol source's override configs */
"Symbol" = "控件";

/* No comment provided by engineer. */
"Symbol is Missing" = "控件丢失";

/* menu local-symbols name */
"Symbols" = "控件";

/* Title for data suppliers section that provide Text Data in the Data menus */
"Text Data" = "文本素材";

/* color counter title */
"Text Layer" = "字符图层";

/* color counter title */
"Text Layers" = "字符图层";

/* The text style override on the symbol source's override configs */
"Text Style" = "字符样式";

/* The text string override on the symbol source's override configs */
"Text Value" = "字符值";

/* Error message when trying to open very old documents */
"The document “%@” could not be opened." = "无法打开文档 “%@”。";

/* States that a pdf file cannot be imported. */
"The file “%@” could not be imported." = "无法导入文件“%@”。";

/* Reason string for an error occurring when trying read the assistant package.json metadata file */
"The package metadata file has an invalid format" = "安装包源数据文件包含了无效格式";

/* Reason string for a failed download */
"The provided URL is not supported" = "不支持所提供的网址";

/* No comment provided by engineer. */
"The value \"%1$@\" is invalid." = "无效值 \"%1$@\"。 ";

/* No comment provided by engineer. */
"The value %1$g is too large." = "值%1$g过大。";

/* No comment provided by engineer. */
"The value %1$g is too small." = "值%1$g过小。";

/* The message shown to the user when they try to open a document with missing or corrupt metadata */
"This document appears to be missing some data.\n\nIf you are sharing it with a service like Dropbox, please ensure that it has finished syncing.\n\nIf the document is not being synced, you can attempt to open it anyway (but we might crash)." = "该文档似乎缺失了某些素材。\n\n若您是通过类似 Dropbox 的服务来分享的，请确保同步已完毕。\n\n同步尚未完毕时，您仍可尝试打开（但可能会发生奔溃）。";

/* Info for Coedit migration warning */
"This document needs to be updated to be compatible with Sketch 71 or newer. You will not be able to save it to Sketch Cloud in older versions of Sketch." = "需要将该文档更新至 Sketch 71 或更高版本。您无法保存该旧版本至 Sketch Cloud。";

/* Error message when trying to open very old documents */
"This document was last saved in a legacy version of Sketch. To open the document in the latest version, please open and save it in Sketch 53 first." = "该文档最后保存的 Sketch 版本十分陈旧。请先将其保存为 Sketch 53，然后再进一步保存为最新的版本。";

/* Provides the reason that the pdf file cannot be imported because it is password protected. */
"This PDF file is password protected." = "该PDF受到密码保护。";

/* color counter title
   The tint override on the symbol source's override configs */
"Tint" = "着色";

/* color counter title */
"Tints" = "色调";

/* One of the options to choose from when the user tries to open a document with missing or corrupt metadata */
"Try to Open Anyway" = "仍然尝试打开";

/* Reason string for an error occurring when trying to extract an assistant package archive */
"Unable to extract the archive" = "无法提取存档";

/* Error description when unable to find a suitable installer for a third-party library. */
"Unable to obtain an installer for library ‘%@’." = "无法获取组件库 ‘%@’ 的安装程序。";

/* The message shown to the user when they try to open a document with missing or corrupt metadata */
"Unable to Open File" = "无法打开文件";

/* Layer list boolean ops menu - Union */
"Union" = "联集";

/* menu item title for unlinking a layer style from the library
   menu item title for unlinking a shared color from the library
   menu item title for unlinking a symbol from the library
   menu item title for unlinking a text style from the library
   menu item title for unlinking from the library */
"Unlink from Library" = "与组件库取消关联";

/* Color Inspector: untitled library source */
"Untitled" = "无标题";

/* Update button on message for Coedit migration warning */
"Update and Open" = "更新并打开";

/* menu item title for updating a single shared color */
"Update Color Variable" = "更新颜色变量";

/* menu item title for updating multiple shared colors */
"Update Color Variables" = "更新颜色变量";

/* menu item title for updating the layer style */
"Update Layer Style" = "更新图层样式";

/* menu item title for updating multiple layer styles */
"Update Layer Styles" = "更新图层样式";

/* menu item title for updating the text style */
"Update Text Style" = "更新字符样式";

/* menu item title for updating multiple text styles */
"Update Text Styles" = "更新字符样式";

